#include <iostream>
using namespace std;
//Возвращаемое_значение имя_функции(параметры){
    //  блок_кода(тело)
    //}

int c = 1;

// 1 Написать функцию, которая принимает два
// параметра: основание степени и показатель степени, и
// вычисляет степень числа на основе полученных данных.
//int degree(int a, int b) {
//    for (int i = b;i > 0;i--){
//         c *= a;
//         
//        
//    }
//    return c;
//}
int summa = 0;
//2 Написать функцию, которая получает в качестве 
// параметров 2 целых числа и возвращает сумму чиселиз диапазона между ними.
//int sum(int a, int b) {
//    for (int i = a; i <= b; i++) {
//        summa += i;
//
//    }
//    return summa;
//}

int main()
{
    setlocale(LC_ALL, "rus");
    //1
    /*int n, st;
    cout << "Введите число:" << endl;
    cin >> n;
    cout << "Введите степень:" << endl;
    cin >> st;
    cout << degree(n, st);*/


    // 2  
    
    /*int n1, n2;
    cout << "Введите число:" << endl;
    cin >> n1;
    cout << "Введите степень:" << endl;
    cin >> n2;
    cout << sum(n1, n2);*/



}








    
        
            
        
    


        
    



        


        
    

    


    

















    







    
               

        

    
    
 
    
    
    













